## This is a test notebook.

In [2]:
#This is a test notebook.

import pandas as pd

### Create new datasets using pandas

In [3]:
sample = {'name':['Mike',  'John', 'Tony'],
        'job':['student', 'student', 'teacher'],
        'age':[24, 23, 45]}

hobby = {'name':['Mike', 'John', 'Penny'],
        'hobby':['football', 'karate', 'cards']}

df = pd.DataFrame(sample)
display(df)

hobby_df = pd.DataFrame(hobby)
display(hobby_df)

   name      job  age
0  Mike  student   24
1  John  student   23
2  Tony  teacher   45

    name     hobby
0   Mike  football
1   John    karate
2  Penny     cards

### Merge two dataframes with left join

In [4]:
new_df = pd.merge(df, hobby_df, how='left', on='name')
new_df

   name      job  age     hobby
0  Mike  student   24  football
1  John  student   23    karate
2  Tony  teacher   45       NaN

### Merge two dataframes with outer join

In [5]:
new_df = pd.merge(df, hobby_df, how='outer', on='name')
new_df

    name      job   age     hobby
0   Mike  student  24.0  football
1   John  student  23.0    karate
2   Tony  teacher  45.0       NaN
3  Penny      NaN   NaN     cards